'''
想观察到更高的温度，至少需要等待的天数，如果不会升高，用0代替
temperats = [73,74,75,71,69,72,76,73]

out: [1,1,4,2,1,1,0,0]

思路：


'''
def dailyTemperatures(T):
    ans = [0] * len(T) # 输出列表
    stack = [] # 存储非递增温度下标 [75,...,76]
    for i in range(len(T)):
        while stack and T[-1] < T[i]:
            '''
            [73] 73<74           [1,0,0,0,0,0,0,0]
            [74] 74<75           [1,1,0,0,0,0,0,0]
            [75,71,69] 69<72     [1,1,0,0,1,0,0,0]
            [75,71] 71<72        [1,1,0,2,1,0,0,0]
            [75,72] 72<76        [1,1,0,2,1,1,0,0] 
            [75] 75<76           [1,1,4,2,1,1,0,0]
            [76]                 [1,1,4,2,1,1,0,0]
            '''
            ans[stack[-1]] = i - stack[-1]
            stack.pop()
        stack.append(i)
    return ans

print(dailyTemperatures([73,74,75,71,69,72,76,73]))

